app/Controllers/Anotacoes.php

UPDATE `anotacoes` SET `titulo` = 'Olá', `conteudo` = 'Testeee'
WHERE `id` = '26'
---
    public function update() {
        $anotacoesModel = new AnotacoesModel();

        $id = $this->request->getPost('id');
        $titulo = $this->request->getPost('tituloEditar');
        $conteudo = $this->request->getPost('conteudoEditar');

        $anotacoesModel->where('id', $id)->set(['titulo' => $titulo, 'conteudo' => $conteudo])->update();