app/Models/AnotacoesModel.php

    public function readAnotacao(){
        return $this->findAll();
---
SELECT *
FROM `anotacoes`

    public function deleteAnotacao($id) {
        return $this->delete($id);
---
DELETE FROM `anotacoes`
WHERE `id` IN ('26')